rogerclarkmelbourne/Arduino_STM32/STM32F1/boards.txt
##############################################################

microduino32_flash.name=Microduino Core STM32 to Flash

microduino32_flash.upload.tool=maple_upload
microduino32_flash.upload.protocol=maple_dfu
microduino32_flash.upload.maximum_size=108000
microduino32_flash.upload.use_1200bps_touch=false
microduino32_flash.upload.file_type=bin
microduino32_flash.upload.ram.maximum_size=17000
microduino32_flash.upload.flash.maximum_size=108000
microduino32_flash.upload.usbID=1EAF:0003
microduino32_flash.upload.altID=1
microduino32_flash.upload.auto_reset=true


microduino32_flash.build.mcu=cortex-m3
microduino32_flash.build.f_cpu=72000000L
microduino32_flash.build.board=MICRODUINO_CORE_STM32
microduino32_flash.build.core=maple
microduino32_flash.build.extra_flags=-DMCU_STM32F103CB -mthumb  -DBOOTLOADER_maple -march=armv7-m -D__STM32F1__ 
microduino32_flash.build.ldscript=ld/flash.ld
microduino32_flash.build.variant=microduino
microduino32_flash.build.variant_system_lib=libmaple.a
microduino32_flash.build.vect=VECT_TAB_FLASH
microduino32_flash.build.density=STM32_MEDIUM_DENSITY
# FIXME!
microduino32_flash.build.error_led_port=GPIOB
microduino32_flash.build.error_led_pin=1
microduino32_flash.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1

##############################################################
nucleo_f103rb.name=STM Nucleo F103RB (STLink)

nucleo_f103rb.upload.tool=stlink_upload
nucleo_f103rb.upload.protocol=maple_dfu
nucleo_f103rb.upload.maximum_size=108000
nucleo_f103rb.upload.use_1200bps_touch=false
nucleo_f103rb.upload.file_type=bin
nucleo_f103rb.upload.ram.maximum_size=17000
nucleo_f103rb.upload.flash.maximum_size=108000
nucleo_f103rb.upload.params.quiet=no

nucleo_f103rb.upload.usbID=1EAF:0003
nucleo_f103rb.upload.altID=1
nucleo_f103rb.upload.auto_reset=true

nucleo_f103rb.build.mcu=cortex-m3
nucleo_f103rb.build.f_cpu=72000000L
nucleo_f103rb.build.board=STM_NUCLEU_F103RB
nucleo_f103rb.build.core=maple
nucleo_f103rb.build.extra_flags=-DMCU_STM32F103RB -mthumb    -march=armv7-m  -D__STM32F1__ 
nucleo_f103rb.build.ldscript=ld/jtag.ld
nucleo_f103rb.build.variant=nucleo_f103rb
nucleo_f103rb.build.variant_system_lib=libmaple.a
nucleo_f103rb.build.vect=VECT_TAB_FLASH
nucleo_f103rb.build.density=STM32_MEDIUM_DENSITY
nucleo_f103rb.build.error_led_port=GPIOB
nucleo_f103rb.build.error_led_pin=1
nucleo_f103rb.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1






##############################################################
#mapleRAM.name=LeafLabs Maple Rev 3+ to RAM

#mapleRAM.upload.tool=maple_upload
#mapleRAM.upload.protocol=maple_dfu
#mapleRAM.upload.maximum_size=17000
#mapleRAM.upload.use_1200bps_touch=false
#mapleRAM.upload.file_type=bin
#mapleRAM.upload.ram.maximum_size=17000
#mapleRAM.upload.flash.maximum_size=108000
#mapleRAM.upload.usbID=1EAF:0003
#mapleRAM.upload.altID=0
#mapleRAM.upload.auto_reset=true
#
#mapleRAM.build.mcu=cortex-m3
#mapleRAM.build.f_cpu=72000000L
#mapleRAM.build.board=MAPLE_REV3_TO_RAM
#mapleRAM.build.core=maple
#mapleRAM.build.extra_flags=-DMCU_STM32F103RB -mthumb  -DBOOTLOADER_maple -march=armv7-m -D__STM32F1__ 
#mapleRAM.build.ldscript=ld/ram.ld
#mapleRAM.build.variant=maple
#mapleRAM.build.variant_system_lib=libmaple.a
#mapleRAM.build.vect=VECT_TAB_RAM
#mapleRAM.build.density=STM32_MEDIUM_DENSITY
#mapleRAM.build.error_led_port=GPIOA
#mapleRAM.build.error_led_pin=5
#mapleRAM.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1


#####################################################################

MapleMiniGeneric.name= Maple mini generic - experimental
MapleMiniGeneric.upload.tool=upload_router
#MapleMiniGeneric.upload.tool=maple_upload
MapleMiniGeneric.build.core=maple
MapleMiniGeneric.build.variant=maple_mini
MapleMiniGeneric.upload.use_1200bps_touch=false
MapleMiniGeneric.upload.file_type=bin
MapleMiniGeneric.upload.usbID=1EAF:0003
MapleMiniGeneric.upload.auto_reset=true
MapleMiniGeneric.build.mcu=cortex-m3
MapleMiniGeneric.build.f_cpu=72000000L
MapleMiniGeneric.build.board=MAPLE_MINI_GENERIC
MapleMiniGeneric.build.core=maple
MapleMiniGeneric.build.common_flags=-mthumb  -march=armv7-m -D__STM32F1__ 
#MapleMiniGeneric.build.extra_flags=-DMCU_STM32F103CB -mthumb  -DBOOTLOADER_maple -march=armv7-m -D__STM32F1__ 
MapleMiniGeneric.build.variant=maple_mini
MapleMiniGeneric.build.variant_system_lib=libmaple.a
MapleMiniGeneric.build.density=STM32_MEDIUM_DENSITY
MapleMiniGeneric.build.error_led_port=GPIOB
MapleMiniGeneric.build.error_led_pin=1

############################ MENU ############################
## GCC VER
## gcc ver 4.8.3
## -------------------------
MapleMiniGeneric.menu.gcc_version.gcc48304q1= gcc-4.8.3
MapleMiniGeneric.menu.gcc_version.gcc48304q1.build.gcc_ver=gcc-arm-none-eabi-4.8.3-2014q1
## gcc ver 4.9
## -------------------------
MapleMiniGeneric.menu.gcc_version.gcc4904q1= gcc-4.9
MapleMiniGeneric.menu.gcc_version.gcc4904q1.build.gcc_ver=gcc-arm-none-eabi-4.9-2014q4

############################ MENU ############################
## GCC VER
## gcc ver 4.8.3
## -------------------------
MapleMiniGeneric.menu.HS_IO.hs_off= HSIO OFF
MapleMiniGeneric.menu.HS_IO.hs_off.build.hs_flag=
## gcc ver 4.9
## -------------------------
MapleMiniGeneric.menu.HS_IO.hs_on= HSIO ON
MapleMiniGeneric.menu.HS_IO.hs_on.build.hs_flag=-DHS_IO


## ==DEBUG MODE==
## Debug off
## -------------------------
MapleMiniGeneric.menu.debug_menu.debug_off=DebugOFF
MapleMiniGeneric.menu.debug_menu.debug_off.build.debuggingMode=0

## Debug on
## -------------------------
MapleMiniGeneric.menu.debug_menu.debug_on=DebugON
MapleMiniGeneric.menu.debug_menu.debug_on.build.debuggingMode=1

## ==UPLOAD MODE==
## F103CB USB to Flash upload
## -------------------------
MapleMiniGeneric.menu.cpu_upload_menu.cbUsbFlash= F103CB(128k) USB->Flash
MapleMiniGeneric.menu.cpu_upload_menu.cbUsbFlash.build.ldscript=ld/flash.ld
MapleMiniGeneric.menu.cpu_upload_menu.cbUsbFlash.build.cpu_flags=-DMCU_STM32F103CB -DBOOTLOADER_maple 
MapleMiniGeneric.menu.cpu_upload_menu.cbUsbFlash.build.vect=VECT_TAB_FLASH

MapleMiniGeneric.menu.cpu_upload_menu.cbUsbFlash.upload.maximum_size=108000
MapleMiniGeneric.menu.cpu_upload_menu.cbUsbFlash.upload.ram.maximum_size=17000
MapleMiniGeneric.menu.cpu_upload_menu.cbUsbFlash.upload.flash.maximum_size=108000
MapleMiniGeneric.menu.cpu_upload_menu.cbUsbFlash.upload.altID=1
MapleMiniGeneric.menu.cpu_upload_menu.cbUsbFlash.upload.protocol=maple_dfu

